//&После("ОбработкаПроверкиЗаполнения")
//Процедура экз_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

////&Перед("ПриЗаписи")
////Процедура экз_ПриЗаписи(Отказ)
//	
////&После("ОбработкаПроведения")
////Процедура экз_ОбработкаПроведения(Отказ, РежимПроведения)
//	
//	Если НЕ Отказ Тогда //И РольДоступна("ЗапретПродажиНижеЦеныРентабельности") Тогда
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ЗаказКлиентаТовары.Номенклатура.Представление КАК Номенклатура,
//		|	ЗаказКлиентаТовары.Характеристика.Представление КАК Характеристика,
//		|	ЗаказКлиентаТовары.Упаковка.Представление КАК Упаковка,
//		|	ЗаказКлиентаТовары.Серия.Представление КАК Серия,
//		|	ЕСТЬNULL(ЗаказКлиентаТовары.НижнийПорогРентабельности, 0) КАК НижнийПорогРентабельности,
//		|	ЕСТЬNULL(ЗаказКлиентаТовары.Цена, 0) КАК Цена
//		|ИЗ
//		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
//		|ГДЕ
//		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
//		|	И ЗаказКлиентаТовары.Цена < ЗаказКлиентаТовары.НижнийПорогРентабельности";
//		
//		Запрос.УстановитьПараметр("Ссылка", Ссылка);
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		Если НЕ РезультатЗапроса.Пустой() Тогда
//			Отказ = Истина;
//			Выборка = РезультатЗапроса.Выбрать();
//			Пока Выборка.Следующий() Цикл
//				СтрНоменклатура = "номенклатуру: " + Выборка.Номенклатура;
//				СтрХарактеристика = ?(ЗначениеЗаполнено(Выборка.Характеристика), ", характеристика: " + Выборка.Характеристика, "");
//				СтрСерия = ?(ЗначениеЗаполнено(Выборка.Серия), ", серия: " + Выборка.Серия, "");
//				СтрУпаковка = ?(ЗначениеЗаполнено(Выборка.Упаковка), ", упаковка: " + Выборка.Упаковка, "");
//				ШаблонСтроки = "Нельзя продать %1%2%3%4, по цене %5 ниже порога рентабельности %6.";
//				
//				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, 
//								 СтрНоменклатура, СтрХарактеристика, СтрСерия, СтрУпаковка, Выборка.Цена, Выборка.НижнийПорогРентабельности);
//				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
//			КонецЦикла;
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры

